<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * lang ru file.
 *
 * @package   local_gigachat
 * @copyright 2025 Gorbatov Sergey s.gorbatov@tu-ugmk.com, Eduardo Kraus {@link https://eduardokraus.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

$string['agentphoto'] = 'Фото агента ИИ';
$string['agentphoto_desc'] = 'Изображение, отображаемое как аватар ИИ-агента во время чат-разговоров.';
$string['apikey'] = 'Ключ API SberGigaChat';
$string['apikey_desc'] = 'Ключ API вашей учетной записи SberGigaChat';
$string['case'] = 'Сценарии использования';
$string['caseuse_balanced'] = 'Сбалансированные ответы => Температура 0.5 - 0.7, Top_p 0.7';
$string['caseuse_chatbot'] = 'Чат-бот => Температура 0.2 - 0.6, Top_p 0.8';
$string['caseuse_creative'] = 'Креативная генерация => Температура 0.7 - 1.0, Top_p 0.8';
$string['caseuse_exploration'] = 'Исследование вариантов => Температура 0.8 - 1.0, Top_p 0.9';
$string['caseuse_formal'] = 'Формальный тон => Температура 0.3 - 0.5, Top_p 0.6';
$string['caseuse_informal'] = 'Неформальный тон => Температура 0.7 - 0.9, Top_p 0.8';
$string['caseuse_precise'] = 'Точные ответы => Температура 0.0 - 0.3, Top_p 1.0';
$string['clear_history_title'] = 'Очистить всю историю';
$string['close_title'] = 'Закрыть чат';
$string['frequency_penalty'] = 'Штраф за частоту';
$string['frequency_penalty_desc'] = 'Этот параметр используется для того, чтобы отговорить модель от слишком частого повторения одних и тех же слов или фраз в генерируемом тексте. Это значение добавляется к логарифмической вероятности токена каждый раз, когда он встречается в генерируемом тексте. Более высокий штраф за частоту заставит модель быть более консервативной при использовании повторяющихся токенов.';
$string['gigachat:manage'] = 'Управление GigaChat';
$string['gigachat:view'] = 'Просмотр GigaChat';
$string['gigachatname'] = 'Имя помощника';
$string['gigachatname_desc'] = 'Определите имя вашего помощника';
$string['h5p-accordion-desc'] = 'Создайте глоссарий, позволяющий студентам быстро находить ответы, не перегружаясь избыточным текстом.';
$string['h5p-accordion-title'] = 'Глоссарий';
$string['h5p-advancedtext-desc'] = 'Создайте цифровую книгу из вашего контента, организовав его в главы логично и увлекательно, чтобы обеспечить целостное и захватывающее деление материала.';
$string['h5p-advancedtext-title'] = 'Цифровая книга';
$string['h5p-block-title'] = 'Заголовок блока';
$string['h5p-create'] = 'Создать H5P с GigaChat';
$string['h5p-create-new'] = 'Создать новый H5P с GigaChat';
$string['h5p-create-this'] = 'Создать с этим ресурсом';
$string['h5p-create-title'] = 'Заголовок H5P';
$string['h5p-create-title-desc'] = 'Определите основной заголовок для содержимого H5P, которое будет отображаться для пользователей в интерфейсе.';
$string['h5p-createpage-title'] = 'Создать новый {$a}';
$string['h5p-crossword-desc'] = 'Создайте интерактивную игру-кроссворд, чтобы заинтересовать студентов, используя ключевые слова из вашего контента для продвижения веселого и динамичного обучения.';
$string['h5p-crossword-title'] = 'Кроссворд';
$string['h5p-delete-success'] = 'H5P успешно удален!';
$string['h5p-dialogcards-desc'] = 'Создайте карточки с диалогами, которые действуют как интерактивные упражнения, чтобы помочь студентам запомнить слова, фразы или ключевые концепции из текстов. На лицевой стороне каждой карточки есть подсказка или ключевое слово, а при перевороте студент видит соответствующую информацию. Эти карточки можно использовать при изучении языков, решении математических задач или помощи студентам в запоминании важных фактов, таких как исторические события, формулы или имена.';
$string['h5p-dialogcards-title'] = 'Карточки с диалогами';
$string['h5p-dragtext-desc'] = 'Создайте игру "Перетащи слова", в которой студент должен перетащить недостающую часть текста в правильное место, формируя полное выражение. Эта игра может использоваться для оценки того, помнит ли студент прочитанный контент или понимает, что было рассмотрено. Кроме того, она помогает студенту глубже размышлять о тексте, способствуя лучшему усвоению содержания.';
$string['h5p-dragtext-title'] = 'Игра "Перетащи слова"';
$string['h5p-example'] = 'См. пример';
$string['h5p-findthewords-desc'] = 'Создайте игру "Найди слова", в которой студенты должны находить и выбирать слова в сетке на основе предоставленного списка.';
$string['h5p-findthewords-title'] = 'Игра "Найди слова"';
$string['h5p-interactivebook-desc'] = 'Создайте интерактивную книгу, которая объединяет различные интерактивные материалы, такие как интерактивные видео, глоссарии, викторины, задания на перетаскивание, кроссворды, игры "найди слова" и многое другое, организованные на нескольких страницах. Добавьте резюме в конце, показывающее общий балл, который студент получил в течение всей книги.';
$string['h5p-interactivebook-title'] = 'Интерактивная книга';
$string['h5p-interactivevideo-desc'] = 'Создайте интерактивное видео с главами и глоссарием, выделяющим ключевые моменты содержания. В конце добавьте интерактивное резюме, чтобы закрепить обучение и повторить рассмотренные темы.';
$string['h5p-interactivevideo-title'] = 'Интерактивное видео';
$string['h5p-manager'] = 'Управление H5P с GigaChat';
$string['h5p-manager-scorm'] = 'Управление SCORM с GigaChat';
$string['h5p-next-step'] = 'Следующий шаг';
$string['h5p-no-apikey'] = '<p>Настройка ключа API GigaChat необходима для правильной работы системы создания учетных записей. Это позволит системе взаимодействовать с GigaChat для выполнения необходимых операций в процессе создания учетной записи.<p><p><a href="{$a}">Нажмите здесь, чтобы настроить ключ API GigaChat.</a></p>';
$string['h5p-page-title'] = 'Создать H5P с GigaChat';
$string['h5p-questionset-desc'] = 'Создайте набор вопросов, который позволяет студентам решать последовательность разнообразных вопросов, включая такие типы, как множественный выбор и правда/ложь, предлагая интерактивный и сложный опыт.';
$string['h5p-questionset-title'] = 'Викторины';
$string['h5p-readmore'] = '...подробнее';
$string['h5p-return'] = 'Вернуться в банк контента';
$string['h5p-title'] = 'Управление банком контента GigaChat';
$string['max_tokens'] = 'Максимальное количество слов в ответе';
$string['max_tokens_desc'] = 'Максимальное количество слов, которые могут быть сгенерированы в каждом запросе.';
$string['message_01'] = 'Привет, {$a}! 🌟';
$string['message_02'] = 'Добро пожаловать на курс {$a->coursename} в Moodle {$a->moodlename}!
Я {$a->gigachatname}, и я здесь, чтобы сделать ваше обучение максимально успешным.
Чем я могу вам помочь сегодня? 🌟📚';
$string['mode'] = 'Режим использования';
$string['mode_desc'] = 'Определите, какой режим использования для баллона вы хотите';
$string['mode_name_gigachat'] = 'Репетитор GigaChat';
$string['mode_name_none'] = 'Нет чат-баллона';
$string['model'] = 'Модель API';
$string['model_desc'] = 'Модель API, которая будет выполнена в SberGigaChat. Доступные значения находятся на <a href="https://developers.sber.ru/docs/ru/gigachat/models" target="_blank">веб-сайте SberGigaChat</a><br>
* <strong>gigachat:latest</strong>: Последняя версия модели GigaChat с улучшенными возможностями и производительностью.<br>
* <strong>gigachat-pro</strong>: Профессиональная версия GigaChat, подходящая для сложных задач и высококачественных ответов.<br>
* <strong>gigachat-max</strong>: Максимальная версия возможностей GigaChat для самых продвинутых и исчерпывающих ответов.<br>
* <strong>gigachat-plus</strong>: Улучшенная версия GigaChat с дополнительными функциями и улучшенной точностью.';
$string['modulename'] = 'GigaChat';
$string['modules'] = 'Модули, скрытые от {$a}';
$string['modules_desc'] = 'Этот список содержит модули, которые не должны быть доступны студентам, чтобы они не использовались в упражнениях.';
$string['online'] = 'В сети';
$string['pluginname'] = 'GigaChat';
$string['presence_penalty'] = 'Штраф за присутствие';
$string['presence_penalty_desc'] = 'Этот параметр используется для поощрения модели включать в генерируемый текст разнообразные токены. Это значение вычитается из логарифмической вероятности токена каждый раз, когда он генерируется. Более высокое значение штрафа за присутствие заставит модель с большей вероятностью генерировать токены, которые еще не были включены в сгенерированный текст.';
$string['privacy:metadata'] = 'Плагин GigaChat сохраняет историю разговоров и передает только полное имя, название курса и URL-адрес в SberGigaChat, не передавая никаких других персональных данных.';
$string['report_completion_tokens'] = 'Количество полученных токенов';
$string['report_datecreated'] = 'День';
$string['report_filename'] = 'Отчет об использовании GigaChat';
$string['report_info'] = '<p>В представленном отчете доступны только первые 100 строк. Чтобы получить доступ ко всем записям, пожалуйста, скачайте полный документ.</p><p>Что касается токенов, то общее правило таково: один токен примерно соответствует около 4 символам обычного английского текста. Это составляет примерно ¾ слова (таким образом, 100 токенов ~= 75 слов). Узнайте больше на странице <a href="https://developers.sber.ru/docs/ru/gigachat/models" target="_blank">Токенизация языковой модели</a>.</p>';
$string['report_model'] = 'Модель GigaChat';
$string['report_prompt_tokens'] = 'Количество отправленных токенов';
$string['report_title'] = 'Отчет';
$string['send_message'] = 'Отправить сообщение';
$string['settings'] = 'Настройка GigaChat';
$string['settings_casedesc'] = 'Параметры температуры и Top_p, определенные для каждого сценария, такие как генерация текста и кода, креативное письмо, чат-бот, генерация текстовых комментариев, анализ данных и исследовательское письмо. Каждая конфигурация влияет на креативность и согласованность модели при генерации содержимого.<br><br>См. таблицу ниже для руководства по использованию Температуры и Top_p:<br>';
$string['settings_casedesc_balancedresp'] = 'Сбалансированные ответы';
$string['settings_casedesc_balancedresp_desc'] = 'Сбалансированные ответы между точностью и креативностью. Идеально для естественных и дружелюбных разговоров.';
$string['settings_casedesc_caseuse'] = 'Сценарий использования';
$string['settings_casedesc_chatbot'] = 'Чат-бот';
$string['settings_casedesc_chatbot_desc'] = 'Быстрые, последовательные и контекстуальные ответы для взаимодействия с пользователями в реальном времени.';
$string['settings_casedesc_creativegen'] = 'Креативная генерация';
$string['settings_casedesc_creativegen_desc'] = 'Производит более креативные, оригинальные или исследовательские ответы. Полезно для мозгового штурма или рассказов.';
$string['settings_casedesc_description'] = 'Описание';
$string['settings_casedesc_formaltones'] = 'Формальные тона';
$string['settings_casedesc_formaltones_desc'] = 'Создает более формальные или технические тексты с меньшим креативным вариациями.';
$string['settings_casedesc_optionexplore'] = 'Исследование вариантов';
$string['settings_casedesc_optionexplore_desc'] = 'Генерирует несколько альтернативных ответов, чтобы рассмотреть различные подходы к вопросу.';
$string['settings_casedesc_preciseresp'] = 'Точные ответы';
$string['settings_casedesc_preciseresp_desc'] = 'Максимальная точность и предсказуемость. Рекомендуется для технических или информационных задач.';
$string['settings_casedesc_relaxedtones'] = 'Расслабленные тона';
$string['settings_casedesc_relaxedtones_desc'] = 'Генерирует более легкие и неформальные тексты с креативным и дружелюбным подходом.';
$string['settings_casedesc_temperature'] = 'Температура';
$string['settings_casedesc_top_p'] = 'Top_p';
$string['talk_gigachat'] = 'Поговорить с {$a} здесь';
$string['write_message'] = 'Написать сообщение...';